# LightSourceInsideGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RenderFailures..::..LightSourceInsideGeometry Property
BuiltInFailures..::..RenderFailures Class See Also
---
Light source is inside solid geometry. No light will be emitted during rendering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LightSourceInsideGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LightSourceInsideGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LightSourceInsideGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RenderFailures Class
Autodesk.Revit.DB Namespace